{
  "latestNews": [
    {
      "id": "beach-contest-2023",
      "title": "2023 Best Beaches Contest Winners",
      "date": "2023-12-15",
      "category": "Awards",
      "summary": "Travlr Getaways wins multiple awards in the annual best beaches contest.",
      "content": "We are thrilled to announce that our resort has won several prestigious awards in the 2023 Best Beaches Contest, including 'Most Beautiful Sunset View' and 'Best Family-Friendly Beach'."
    },
    {
      "id": "diving-spots-2024",
      "title": "Top 10 Diving Spots",
      "date": "2024-01-10",
      "category": "Activities",
      "summary": "Discover the most spectacular diving locations around our resort.",
      "content": "Our marine biologists have compiled a list of the top 10 diving spots accessible from our resort, featuring coral reefs, underwater caves, and diverse marine life."
    },
    {
      "id": "fishing-ban-2024",
      "title": "Fishing ban to be implemented this year",
      "date": "2024-02-01",
      "category": "Environmental",
      "summary": "New conservation measures to protect marine ecosystem.",
      "content": "In partnership with local environmental groups, a temporary fishing ban will be implemented in certain areas to allow marine life to recover and thrive."
    },
    {
      "id": "lifeguard-rescue",
      "title": "Lifeguard saves child from drowning",
      "date": "2024-01-25",
      "category": "Safety",
      "summary": "Quick action by our trained lifeguard prevents tragedy.",
      "content": "Our certified lifeguard team successfully rescued a young guest, demonstrating the importance of our comprehensive water safety program."
    }
  ],
  "vacationTips": [
    {
      "id": "beach-essentials",
      "title": "What to bring on the beach?",
      "category": "Preparation",
      "summary": "Essential items for a perfect beach day.",
      "content": "Sunscreen, water, hat, beach towel, and waterproof phone case are must-have items for any beach adventure."
    },
    {
      "id": "fun-activities",
      "title": "Planning Fun Activities",
      "category": "Entertainment",
      "summary": "Make the most of your beach vacation.",
      "content": "From beach volleyball to snorkeling, plan activities that match your energy level and interests."
    },
    {
      "id": "diving-checklist",
      "title": "Diving Checklist",
      "category": "Safety",
      "summary": "Safety first when exploring underwater.",
      "content": "Always check your equipment, dive with a buddy, and follow depth limits for a safe diving experience."
    },
    {
      "id": "first-aid",
      "title": "First Aid",
      "category": "Safety",
      "summary": "Basic first aid knowledge for beach activities.",
      "content": "Know how to treat sunburn, cuts from shells, and recognize signs of heat exhaustion."
    },
    {
      "id": "sand-castle",
      "title": "How to Build a Sand Castle?",
      "category": "Family Fun",
      "summary": "Tips for creating amazing sand sculptures.",
      "content": "Use wet sand, bring the right tools, and start with a solid foundation for impressive sand castles."
    },
    {
      "id": "tanning-tips",
      "title": "Tanning Tips",
      "category": "Health",
      "summary": "Safe tanning practices for healthy skin.",
      "content": "Use SPF protection, limit exposure time, and stay hydrated for a safe and healthy tan."
    }
  ]
}
